#โปรแกรมคำนวณเกรด
score = int(input("กรุณาป้อนเกรดของคุณ: "))

if score >= 80 and score <= 100: #80-100
    print("คุณได้เกรด: A")
elif score >= 70 and score <= 79: #70-79
    print("คุณได้เกรด: B")
elif score >= 0 and score <= 69: #0-69
    print("คุณได้เกรด: F")
else: #คำสั่งนี้ทำงานเมื่อผู้ใช้ป้อนข้อมูลไม่ถูกต้อง
    print("กรุณาป้อนข้อมูลใหม่ให้ถูกต้อง")



#โปรแกรมตรวจสอบชื่อผู้ใช้และรหัสผ่าน
username = input("กรุณาป้อนชื่อผู้ใช้: ") #ป้อนชื่อผู้ใช้
password = input("กรุณาป้อนรหัสผ่าน: ") #ป้อนรหัสผ่าน(ชนิดข้อมูลเป็นตัวอักษร strings)

if username == "admin" and password == "1234": #กำหนดให้ต้องป้อนชื่อผู้ใช้และรหัสผ่านให้ถูกต้องทั้งสองอย่าง
    print("เข้าสู่ระบบสำเร็จ") #ถ้าป้อนถูกต้องทั้งสองอย่างจะแสดงข้อความนี้
else:
    print("ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง") #ถ้าป้อนผิดจะแสดงข้อความนี้
