#โปรแกรมคำนวณเกรด
score = int(input("กรุณาป้อนเกรดของคุณ: "))

if score >= 80 and score <= 100: #80-100
    print("คุณได้เกรด: A")
elif score >= 70 and score <= 79: #70-79
    print("คุณได้เกรด: B")
elif score >= 0 and score <= 69: #0-69
    print("คุณได้เกรด: F")
else: #คำสั่งนี้ทำงานเมื่อผู้ใช้ป้อนข้อมูลไม่ถูกต้อง
    print("กรุณาป้อนข้อมูลใหม่ให้ถูกต้อง")



#โปรแกรมตรวจสอบชื่อผู้ใช้และรหัสผ่าน(Neasted-if)
username = input("กรุณาป้อนชื่อผู้ใช้: ") #ป้อนชื่อผู้ใช้
password = input("กรุณาป้อนรหัสผ่าน: ") #ป้อนรหัสผ่าน(ชนิดข้อมูลเป็นตัวอักษร strings)

if username == "admin" and password == "1234": #กำหนดให้ต้องป้อนชื่อผู้ใช้และรหัสผ่านให้ถูกต้องทั้งสองอย่าง(if เงื่อนไขหลัก)
    print("เข้าสู่ระบบสำเร็จ") #ถ้าป้อนถูกต้องทั้งสองอย่างจะแสดงข้อความนี้
    service = input("ป้อนหมายเลขบริการ(1-3): ") #ป้อนบริการที่ต้องการใช้(ทำงานภายใต้คำสั่ง if เงื่อนไขหลัก)
    if service == "1": #ถ้าป้อนหมายเลขบริการเป็น 1(ทำงานภายใต้คำสั่ง if เงื่อนไขหลัก)
        print("ถอนเงิน") #จะแสดงข้อความนี้
    elif service == "2": #ถ้าป้อนหมายเลขบริการเป็น 2(ทำงานภายใต้คำสั่ง if เงื่อนไขหลัก)
        print("ฝากเงิน") #จะแสดงข้อความนี้
    elif service == "3": #ถ้าป้อนหมายเลขบริการเป็น 3(ทำงานภายใต้คำสั่ง if เงื่อนไขหลัก)
        print("ตรวจสอบยอดเงิน") #จะแสดงข้อความนี้
    else: #ถ้าป้อนหมายเลขบริการไม่ใช่ 1,2,3
        print("กรุณาป้อนหมายเลขบริการใหม่ให้ถูกต้อง") #จะแสดงข้อความนี้
else:
    print("ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง") #ถ้าป้อนผิดจะแสดงข้อความนี้

#Learn match statement
service = input("ป้อนหมายเลขบริการ(1-3): ") #ป้อนบริการที่ต้องการใช้

match service: #ใช้คำสั่ง match เพื่อตรวจสอบค่าของตัวแปร service
    case "1": print("ถอนเงิน") #ถ้าป้อนหมายเลขบริการเป็น 1 จะแสดงข้อความนี้
    case "2": print("ฝากเงิน") #ถ้าป้อนหมายเลขบริการเป็น 2 จะแสดงข้อความนี้
    case "3": print("ดูยอดเงินคงเหลือในบัญชี") #ถ้าป้อนหมายเลขบริการเป็น 3 จะแสดงข้อความนี้
    case "": print("กรุณาป้อนหมายเลขบริการใหม่ให้ถูกต้อง") #ถ้าป้อนหมายเลขบริการไม่ใช่ 1,2,3 จะแสดงข้อความนี้
    


number = 100
while number < 10:
    number += 1
    print(number)
print("จบการทำงานของโปรแกรม")




#โปรแกรมแม่สูตรคูณ
numbers = int(input("กรุณาป้อนตัวเลขที่ต้องการดูแม่สูตรคูณ: ")) #ป้อนตัวเลขที่ต้องการดูแม่สูตรคูณ

for n in range(1,13): #ใช้คำสั่ง for เพื่อวนลูปตั้งแต่ 1 ถึง 12
    print(numbers,"x",n,"=",numbers*n)


#break and continue
for counter in range(1, 11): #ใช้คำสั่ง for เพื่อวนลูปตั้งแต่ 1 ถึง 10
    if counter==5: #ถ้า counter เท่ากับ 5 จะทำงานคำสั่ง break
        break #คำสั่ง break จะหยุดการทำงานของลูปทันทีเมื่อนับถึง 5 , แต่ถ้าเป็น continue จะข้ามการทำงานของลูปในรอบนั้นและไปทำงานรอบถัดไปคือข้ามเลข 5
    print(counter) #แสดงค่า counter

print("จบการทำงานของโปรแกรม")